[
  {
    "title": "Chicken Tawa Fry",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_1.jpg",
    "category": "nonveg",
    "ingredients": "1. Boneless Chicken\n 2. Yogurt\n 3. Coriender leaves\n 4.Turmeric Powder\n 5. Chilly Powder\n 6. Coriender Powder\n 7. Ginger Garlic Paste\n 8. Salt\n 9. Kasuri Methi\n 10. Gharam Masala\n 11. Cheese\n 12. Maggie masala(optional)",
    "instructions": " 1. For the marination take a bowl and add boneless chicken, yogurt, chilly powder, a pinch of turmeric powder, gharam masala powder, coriender powder, ginger garlic paste, one cube of gratted cheese, crushed kasuri methi, chopped Coriender leaves and salt as per taste.\n\n 2. Mix it well and keep it aside for atleast 20-30min.\n\n 3. Then add oil/butter to the tawa and cook the chicken on both side."
  },
  {
    "title": "Paneer Lababdar",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_2.jpg",
    "category": "veg",
    "ingredients": " Paneer - 300 Gms, Oil - 1 Tbsp, Onion - 2 Nos (Chopped), Red Chilies - 10 Nos. Tomato - 3 Nos ChoppedSalt - 1 Tsp, Cashew Nuts - 1/4 Cup, Ghee - 3 Tsp, Kashmiri Chili Powder - 2 Tsp, Garam Masala - 1 Tsp, Kasuri Methi, Coriander Leaves, Unsweetened Khoya - 50 Gms, Milk - 3 Tbsp, Fresh Cream - 2 Tbsp, Sugar - 1 Tsp, Water - 1/4 Cup, Salt - 1 Tsp ",
    "instructions": "1. Heat some oil in a kadai, add onions, red chilies, tomatoes, and cashews and saute till they are completely cooked. 2. Add salt and cook till tomatoes are mushy. Turn off the stove.3. Cool the ingredients and grind them to a smooth paste. 4. Heat a kadai with ghee, add red chili powder.5. Pour in the ground paste and add a little water which was added to the mixer jar to remove the paste stuck to it.6. Now add garam masala, kasuri methi and chopped coriander leaves.7. Close the kadai and let it simmer for about 10 minutes on low flame.8. To a mixer jar, add khoya and milk. Grind them into a fine paste to give the curry a creamier texture.9. Add fresh cream, ground khoya mixture and sugar to the gravy and give it a quick mix.10. Add water, season the gravy with salt and mix it well.11. Now add paneer cubes to the gravy, close the kadai and cook for 10 minutes on low-flame. 12. Turn off the stove and serve it hot with a dollop of butter."
  },
  {
    "title": "Anjal Rava Fry",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_3.jpg",
    "category": "nonveg",
    "ingredients": " 4 – 5 pieces of king fish (Surmai ), 1 tsp ginger garlic paste, ½ tsp turmeric powder, 2 tsp of chilli powder, salt to taste, 2 – 3 tbsp tamarind water, 1 cup semolina, coconut oil for shallow frying",
    "instructions": " Prepare a masala by mixing together ginger garlic paste, turmeric powder, chilli powder, salt & tamarind water (by adding tamarind to hot water).In a frying pan heat some coconut oil and leave it on a low flame. Coat the fish with the prepared masala and then cover it with rava/semolina. Place the fish slices in the frying pan. Fry them for 5 to 7 mins in low flame, until they are cooked properly from both the sides. Once the fish is cooked take it off the gas and the dish is ready to be served! "
  },
  {
    "title": "Paneer Dum Biryani",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_4.jpg",
    "category": "veg",
    "ingredients": " For Paneer Marination : Onion - 1 (large), Yogurt / Dahi - 3 tbsp, Chopped Coriander - 1 tbsp, Salt - 1/2 tsp, Sugar - 3/4 tsp, Kasoori methi - 1/4 tsp, Black Pepper - 1/4 tsp, Dried Mint - 1 pinch, Red Chili Powder - 1/4 tsp, Turmeric powder - 1/4 tsp, Cloves - 7 (crushed), Paneer - 250 g (diced). For Biryani : Oil - 2 tbsp, Ghee - 1 tbsp, Jeera - 1/2 tsp, Bay Leaf - 2, Green Cardamom - 5, Cloves - 4, Black Peppercorns - 1/4 tsp, Star Anise - 1, Onion - 1 (finely chopped), Salt - 1 tsp, Ginger Garlic Paste - 1/2 tbsp, Tomato - 1 large, Chili Powder - 1 tsp, Coriander Powder - 1 tsp, Garam Masala - 3/4 tsp, Kasoori methi - 1/4 tsp, Mint & Coriander Leaves - 1 Sprig, Pepper - 1/4 tsp, Sugar - 1/2 tsp. For Rice : Basmati Rice - 2 Cups, Oil from Birista, Salt to season ",
    "instructions": "For Marination Birista : Slice 1 onion and separate the onion slices, add to a pan along with 3 tbsp oil. Fry in low flame stirring continuousl until light golden. Take down to a tissue paper and spread. And collect the oil to use for boiling rice. Chop the birista int smaller pieces. In a bowl, add in the birista, yogurt, coriander leaves, salt, sugar,kasoori methi, black pepper, dried mint, red chili powder turmeric powder and crushed cloves. Mix the marination well, add in the diced paneer cubes and stir gently. Cover and let it marinate for 1 hour. For Rice Soak rice for 1 hour. Boil 8 cups of water, add salt to season the water and oil from the birista. add the soaked rice and boil til 75% done. Drain the rice and spread in a plate. For Biryani Masala : In a pressure pan/cooker, add in the oil and ghee. Once hot, cumin seeds and after they sizzle, goes in cardamom pods cloves, peppercorns, bay leafs and star anise. Add in the chopped onions and cook till they start going golden, then add ginger garlic paste. Once raw flavor from ginger garlic i gone, add the chopped tomatoes and salt. Cook till the tomatoes are mushy, then add in : turmeric powder, black pepper, coriander powder, garam masala, red chili powder kasoori methi and sugar and cook for 2-3 minutes. Then add in coriander and mint leaves and stir. Pour in about a cup of water an get it to a boil. Switch off the flame, and begin layering the biryani. On top of this masala gravy, add in 1/2 of the cooked rice. Next goes in all o the marinated paneer, then rest of the rice. Pour in about 1/4 cup of water. You can add in some cashews or nuts if you wish, some saffron water can go in as well. Cover the pan with the lid and heat it up i medium flame for 3-4 minutes, then about 20 minutes in low flame. Let the biryani stay idle for a minimum of 30 minutes before opening. Open the pan, serve the biryani!"
  },
  {
    "title": "Paneer Chilli",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_5.jpg",
    "category": "veg",
    "ingredients": "For Batter: 2 tbsp refined flour, 1 tbsp corn starch, A pinch of Sal, ¼ cup wate, 1 tbsp corn starch (for Coating paneer, 250 gms Paneer, cut in cubes, Oil to deep fry. For Chilli Paneer Sauce: 1 tbsp oil, 1 tbsp ginger, finely choppe, 1 tbsp garlic, finely choppe, 2 dry red chilli, roughly choppe, 1 tbsp celery, choppe, 1 medium onion, cut in quarters, 1 small capsicum, cut in cubes, 1 tbsp soy sauce, 2 fresh red & green chilli, slice, 1 tbsp green chilli sauc, 1 tbsp Sweet & Sour sauce, 1 tsp suga, 1 tbsp corn flour slurry (corn flour + water mixed), Handful of spring onion",
    "instructions": " For Coating paneer add refined flour, corn flour, salt and water to a bowl, mix well and set aside till in use. Add the corn starch to the paneer cubes and coat well, pour over the prepared batter and mix well coating all the paneer cubes evenly. Deep fry the coated paneer cubes till light golden, drain on absorbent paper. Set aside till in use. Heat oil in a pan, add ginger, garlic, whole red chilli and celery. Mix well and sauté for a few minutes. Add onions and capsicum, sauté till onions are fragrant. Add soy sauce and toss well to coat. Add fresh red and green chillies, sauté for a few seconds. Add green chilli sauce, sweet & sour sauce, mix and toss well. Add little water, sugar and cook till it melts. Add some more water and the corn flour slurry, cook till the sauce thickens. Add the fried paneer cubes and spring onions, toss well. "
  },
  {
    "title": "Cheese-veg nachos",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_6.jpg",
    "category": "veg",
    "ingredients": " Mozzarella Cheese - 200 Gms, Chopped Green Capsicum, Cooked Sweet Corn - 1 Cup, Italian Seasoning - 2 Tsp, Chilli Flakes - 1 Tsp, Pepper - 1/2 Tsp, Salt - 1/2 Tsp , Tomato Ketchup - 1 1/2 Tbsp",
    "instructions": "Grate the Mozzarella cheese and keep it aside. To a bowl, add green capsicum, cooked corn, grated mozzarella cheese, italian seasoning, Chilli flakes, pepper, and salt. Mix everything together. Now add tomato ketchup and mix again. On a plate, start placing the Nacho chips and spread it evenly. Add the topping generouly over the nacho chips. Place this plate over a pan and cover the pan. On low flame, let is cook for about 15 - 20 mins. Cheesy stringy vegetable nachos is ready. "
  },
  {
    "title": "Aloo Paratha",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_7.jpg",
    "category": "veg",
    "ingredients": "Wheat flour - 2 cup, Ajwain - 1/2 tsp, Potatoes - 4 nos, Green chilies - 2 nos (chopped), Garam masala - 1/2 tsp, Kashmiri Red Chili Powder - 1 tsp, Chaat Masala Powder - 1/2 tsp, Coriander leaves (chopped), Water, Oil , Salt ",
    "instructions": " Mix wheat flour, carom seeds, salt and water and knead it to get a dough. Rest the dough while we make the filling . Boil the potatoes and peel them and mash them roughly . Add green chilies, coriander leaves, red chili powder, garam masala powder, and chaat masala . Mix till everything is well combined. Divide the dough into equal sized dough balls. Flatten the dough balls and place the filling in the centre. Fold the flattened dough with the filling into a parcel. Flatten it again and roll it out. Roll out all the dough balls in the  same way. Heat a tawa, place the rolled out parathas onto the hot tawa. Flip the paratha once it is cooked on one side. Add some oil on the edges and cook on both sides till they turn golden. Serve the Aloo Paratha hot."
  },
  {
    "title": "Crispy Paneer Burger",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_8.jpg",
    "category": "veg",
    "ingredients": "Sweet & spicy mayonnaise:  Mayonnaise 3/4th cup, Tomato ketchup 2 tbsp, Red chilli sauce 2 tbsp, Garlic 1/4 tsp (Chopped). For spicy paneer patty : Paneer 500 gm, Refined flour 1/2 cup, Red chilli powder 1 tbsp, Green chilli paste 1 tsp, Ginger garlic paste 1 tbsp, Amchur powder 1 tsp,  Garam masala a pinch, Salt & black pepper powder to taste , Water a required, Bread crumbs 1 cup",
    "instructions": "Cut the paneer into rectangle slab, keep aside. In a mixing bowl, add refined flour, red chilli powder, green chilli paste, amchur powder, garam masal ginger garlic paste and salt & pepper to taste. Mix well and add water to make thick batter, keep aside. Take breadcrumbs and add Salt & black pepper powder to taste mix well and now start by coating the pane slab first, by dipping the paneer in the batter and then coat it with the seasoned bread crumbs. Coat  many paneers as you want. Set oil in a pan on medium high heat, deep fry the coated paneer patty until crisp and golden brown"
  },
  {
    "title": "Paneer Gheeroast",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_9.jpg",
    "category": "veg",
    "ingredients": "Guntur dry red chilli 3-4 nos., Kashmiri dry red chilli 3-4 nos., Coriander seeds 1 tbsp, Jeera 1 tbsp, Black pepper corn 1 tbsp, Fennel seeds 1 tbsp, Methi seeds 1 tsp, Cloves 3-4 nos., Garlic 5-6 cloves, Ginger 1 inch, Tamarind water 2 tbsp, Water 2 tbsp, Ghee 2 tbsp, Paneer 400 gm (cubes), Onion 1/4th cup (chopped), Curd 2 tbsp (whisked), Sugar / jaggery 1 tsp, Curry leaves 8-10 nos.",
    "instructions": "• Dry roast the whole red chillies for 2-3 minutes, dry roast the other whole spices until their aromas are released. Add the roasted whole spices along with roasted whole red chillies in a blending jar, add garlic, ginger and tamarind water, grind into a fine paste, adjust the consistency by adding little water. Heat ghee in a pan, shallow fry the paneer from all sides until golden brown. Heat the ghee in a wok, use the same ghee used for frying paneer, fry the chopped onions until they are translucent. Add the freshly prepared masala paste, stir and cook on low flame for 1-2 minutes, add curd and keep stirring continuously.  Increase the flame and cook until ghee is released. Add salt, sugar / jaggery to balance the taste, you can skip if u do not prefer sweet. Cook of another 2-3 minutes, add the fried paneer cubes, curry leaves. Coat the paneer with the masala and cook further 3-4 minutes."
  },
  {
    "title": "Soya chunk fry",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_11.jpg",
    "category": "veg",
    "ingredients": "1/2 Cup Soya Soaked in Warm Water for 15 Minutes, 2 Onion, Shredded, 2 Green Chilli, Slit, 1 Big Piece Ginger, 1/2 Tsp Garam Masala, 1/2 Tsp Chat Masala, Lemon Juice, 2 Tomato, Finely Chopped, 4 Garlic, Sliced, Coriander Leaves",
    "instructions": "Soak the Soya Chunks for 15 minutes in hot water and add a pinch of salt. Heat oil add shredded onions cook them for a couple of minutes, sliced garlic, ginger, green chilies, tomatoes, and all the spices red chilli powder, garam masala, chat masala. Drain out the water from the Soya chunks and add them to the pan. Toss the chunks properly in the masala. Add some lemon juice and mix well and add salt to taste and some coriander"
  },
  {
    "title": "Desi Egg Noodles",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_12.jpg",
    "category": "nonveg",
    "ingredients": "Oil - 1 1/2 Tbsp, Garlic - 1 Tbsp Finely Chopped, Ginger - 1 Tbsp Finely Chopped, Onion - 1 No. Thinly Sliced , Capsicum - 1/2 Cup Thinly Sliced , Carrot - 1 No. , Shredded Cabbage - 1 Cup , Vinegar - 1 Tsp, Soy Sauce - 2 Tbsp , Chili Sauce - 2 Tbsp, Spring Onion Whites, Oil - 2 Tsp, Egg - 4 Nos, Pepper ",
    "instructions": "1. Boil some water, add salt and the noodles, and cook the noodle 2. Strain the noodles once they are done  3. Add some oil to the noodles and keep them asid 4. Heat a wok with some oil, add ginger, garlic, onion 5. Add cabbage, carrots, capsicum and stir fry them on high flame 6. Add vinegar, soy sauce, red chili sauce and mix well  7. Add spring onions whites and stir it 8. Make a well in the centre, add some oil, add eggs  9. Season it with pepper and scramble them 10. Add the cooked noodles and mix well, be careful not to break the noodles 11. Finally, add some spring onions and turn off the stove"
  },
  {
    "title": "Egg Chilli",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_13.jpg",
    "category": "nonveg",
    "ingredients": "Eggs 5 nos. (boiled), Refined flour ½ cup, Cornstarch 1/4th cup, Salt to taste, Black pepper powder 1/4th tsp, Water as required, Oil 1 tbsp, Garlic 1 tbsp (minced), Ginger ½ tbsp (grated), Green chillies 3-4 nos., Spring onion bulbs 1/4th cup (chopped), Capsicum 1 medium size (diced), Soy sauce 2 tbsp, Red chilli sauce 2 tbsp, Black pepper powder 1/4th tsp, Salt to taste, Cornstarch 1 tbsp + water 100 ml, Spring onion greens 2 tbsp",
    "instructions": "Cut the boiled eggs in 4 equal halves. In a mixing bowl, add refined flour, cornstarch, salt & pepper and mix well, add water as required to make smooth & semi thick batter, dip the boiled egg wedge and coat it well. Set a deep pan or kadhai filled with oil for frying on medium heat, deep fry the coated boiled eggs until crisp and golden brown. Remove it on an absorbent paper and keep aside for a while.Heat oil in a pan on high heat, add garlic, ginger and spring onion bulbs, sauté for a minute keeping the flame on high heat. Add capsicum and sauté further for a minute, add the soy sauce, red chilli sauce and salt & pepper and continue to sauté for a minute on a high flame. In a separate small bowl mix the cornstarch and water and add the mixture to the pan and cook until the sauce thickens, add the crispy fried eggs and toss well, coat the fried eggs with sauce completely."
  },
  {
    "title": "Panner Malai tikka",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_14.jpg",
    "category": "veg",
    "ingredients": " Malai / Heavy Cream – 3 tbsp, Cream / Milk – 3 tbsp, Cashewnut Powder – 2 tbsp, Ginger garlic paste – ½ tsp, Salt - as per taste, Coriander leaves – 1 tbsp (chopped), Green Chili - 1 small (chopped), Kasoori Methi - 1/2 tsp, Besan - 1 tsp, Fennel Seeds - 1/2 tsp, Cardamom Pods - 4-5, Black Pepper - 1/4 tsp, Paneer - 250g {diced, 16 pieces}, Sugar - 1/4 tsp, Capsicums,Onion",
    "instructions": " For the marination take a bowl and add paneer cubes and other ingridients mentioned above and mix it gently. Keep it aside for atleast 20-30min. Then insert the veggies and paneer to screwer and cook it directly in gas flame. Keep turning the screwer, apply butter on each side and your Malai paneer tikka is ready."
  },
  {
    "title": "Cheese Garlic Maggie",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_15.jpg",
    "category": "veg",
    "ingredients": "Butter 1 tbsp, Garlic minced 1 tbsp, Chilli flakes 1 tsp, Pepper powder 1/2 tsp, Sat to taste, Maggi 1 pack, Taste maker 1 pack, Hand full of coriander, Cheese grated 1/4 cup ",
    "instructions": "1. Heat butter 2. Add garlic and saute till raw flavour goes away  3. Add chilli flakes pepper salt and 1 tbsp coriande 4. Immediately add water and bring it to boil 5. Add Maggi to boiling water cook for 2 minutes 6. Add Maggi masala and coriander 7. Mix well 8. Add water if required 9. Add cheese and mix well. "
  },
  {
    "title": "Crispy Paneer Fingers",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_16.jpg",
    "category": "veg",
    "ingredients": "Turmeric powder - 1/4 tsp, Chili powder - 1/2 tsp, Salt, Oil, All purpose flour - 4 tbsp, Corn flour - 2 tbsp, Water, Bread Crumbs",
    "instructions": " 1.Cut the Paneer into finger size pieces. 2.Add spices to it - 1/4 tsp of Turmeric powder, 1/2 tsp of Chili powder, 1/2 tsp of Salt and Pepper. 3.Toss this and let it sit for 10 minutes. 4.For Batter, add 4 tbsp of All purpose flour or Maida, 2 tbsp of Corn flour, Salt, Pepper and mix it well with Water till getting thick consistency. 5.Dip the paneer fingers into the batter, make sure it is fully coated and put it into Bread Crumbs and coat it well. 6.Make sure the oil is nice and hot in a pan), Gently place it into the Oil."
  },
  {
    "title": "Paneer Butter Garlic",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_17.jpg",
    "category": "veg",
    "ingredients": " Butter – 2 tbsp, Garlic – 1 tbsp, Paneer cubes -300gm, Water – 3 tbsp, Fresh crème – 4-5 tbsp, Salt – a pinch, Black Pepper pdr – 1 tsp, Oregano -1/2 tsp, Chilly flakes – ½ tsp, Processed Cheese – 1 tbsp, Coriander leaves – 1 tsp",
    "instructions": "1. Heat a pan and add butter , let the butter melt ( do not burn),on low flame 2. Add chopped garlic and sauté for 1 minute 3. Add paneer and sauté for 2 minutes 4. Add little water , give it a mix, cover and cook for about 3 minutes 5. Add fresh crème, a pinch of salt, black pepper pdr, oregano, chilly flakes , and mix well 6. Add processed cheese and coriander leaves, mix it well and let it cook for about 4-5 minutes on low flame."
  },
  {
    "title": "Tri-color Paneer Tikka",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_18.jpg",
    "category": "veg",
    "ingredients": "  Onion, Capsicum, Tomato, Paneer, Hung Curd, Coriender leaves, Mint leaves, Turmeric Powder, Chilly Powder, Salt, Kasuri Methi, Gharam Masala, ginger, garlic, chat masala, Jeera",
    "instructions": "Hariyali Paneer Tikka: For the marination take a bowl and add Hung curd to it, add chilly powder, a pinch of turmeric powder, gharam masala powder, crushed kasuri methi and salt as per taste. Grind hand full of Coriender leaves, mint leaves, garlic and small peice of ginger, jeera to a smooth paste. Mix it with the curd mixtures. Add diced veggies and paneer and mix it gently. Keep it aside for atleast 20-30min. Then insert the veggies and paneer to screwer and cook it directly in gas flame. Keep turning the screwer, apply butter on each side and your Hariyali paneer tikka is ready. Other two recipes(Malai & Tandoori) are shared seperately. Please check them out"
  },
  {
    "title": "Baby Corn Pepper",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_19.jpg",
    "category": "veg",
    "ingredients": " 20 baby corns, 3 tablespoons rice flour, 1 tablespoon plain flour, 1/2 teaspoon pepper powder, salt to taste, oil for frying, 1/2 teaspoon cumin seeds, 1/2 cup chopped onions, 1 cup chopped bell peppers, 3/4 teaspoon pepper powder, salt to taste, 2 teaspoons lemon juice, ",
    "instructions": " 1. Peel the baby corns and remove the feathers thoroughly. Chop them as required 2.Bring a big pot of water to a rolling boil. Add salt and turmeric powder. Mix well and add the chopped baby corns 3.Blanch for five minutes. Drain and let dry for few minute 4.Combine the blanched baby corns, plain flour, rice flour, salt and pepper powder in a bowl. Mix and toss well. Do not add water 5.Heat oil in a pan. Slide the batter coated corns into the hot oil 6.Fry until golden and crispy. Set aside 7.Heat 2 tablespoons sesame oil in a pan or wok 8.Add cumin seeds, chopped onions and saute well till onions turn soft 9.Add chopped bell pepper and mix well 10.Next add pepper powder and salt to taste. Saute in high flame for 6-7 minutes 11.Add the fried baby corns and toss quickly 12.Serve with a squeeze of lemon juice."
  },
  {
    "title": "Anjal Tawa Fry",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_21.jpg",
    "category": "nonveg",
    "ingredients": "Byadgy chilli- 20, short chilli- 5, ginger - 1, garlic - 5-6, vinegar - 1-2 ts, turmeric powder- 1/2 ts, coriander seeds- 2 ts, cumin seeds - 1/2 ts, curry leaves few, coconut oil for frying, peppercorns - 10, salt as per taste",
    "instructions": " soak chillies in hot water +1 tbs vinegar for 10 - 30 mins. Grind all masalas along with chillies and 1 ts vinegar ,few curry leaves and water into thick and fine paste. Marinate the fish with masala and refrigerate for 30 mins or deep freeze for 10 mins. Fry in coconut oil on both sides ,add few curry leaves"
  },
  {
    "title": "Steamed Paneer momos",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_28.jpg",
    "category": "veg",
    "ingredients": "For Dough:Refined Flour- 1 Cup, Salt -1/4 tsp, Oil - 1.5 tbsp, Ginger - 1 inch baton,Green Chilli - 1 finely chopped, Capsicum - 1/4 Cup ,Cabbage - 1 Cup grated, Paneer - 1 Cup grated, Salt - 1/2 tsp,Black Pepper - 1/2 tsp",
    "instructions": " 1. Take 1 cup of maida, add ¼ tsp of salt and mix well. Add water gradually and prepare a stiff dough. Cover and set aside for 30 minutes. Heat 1.5 tbsp of oil in the pan, add 1-inch grated ginger, 1-chopped green chili, ¼ cup of finely chopped capsicum, and roast briefly.  Add 1 cup of grated cabbage, 1 cup of grated paneer, ½ tsp of salt, ½ tsp of crushed black pepper to the pan and mix well. Take the stuffing out in a bowl and allow it to cool. Knead the dough again after 30 minutes and divide it into portions. Take a portion of the dough and roll it into a sheet of 3 inches in diameter. Likewise, prepare all the sheets.Place a sheet on your palm and add 1 tsp or ½ tsp of stuffing.Start pleating and sticking them to the previous fold till the other end. Similarly, prepare all the momos. Boil water in a cooking vessel for streaming, grease a sieve with oil, and place all the momos on the sieve. Place the sieve inside the cooking vessel and steam the momos for 10 minutes over medium heat. Paneer momos are ready to be served."
  },
  {
    "title": "Butter Chicken",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_22.jpg",
    "category": "nonveg",
    "ingredients": "300 gms Chicken breast boneless, 1 tbsp Ginger garlic paste, 1 tbsp Red chilli powder, Salt to taste, Oil to pan fry, For the gravy, 500 gms  roughly slit tomatoes, 100 gms roughly cut onions, 1 tbsp garlic paste, 50 gms cashew, 1 tsp kasoori methi, 1/2 tsp garam masala, 4 tbsp sugar, 2 tbsp kashmiri chilli powder, 5 tbsp butter, 3 tbsp cream, 1.5 tbsp White Vinegar",
    "instructions": "Marinate the chicken with  ginger paste, garlic paste, red chili powder, and salt and keep it aside for 15 to 20 minutes. In a pan heat, some oil then fries the marinated chicken pieces in it, once done place it into a bowl. In the same pan add onion, oil, a spoonful of butter and once the onions are cooked add tomatoes and cashew nuts Add some water and garlic paste, salt, vinegar, sugar, garam masala powder, and chili powder. Evenly mix it and let it simmer for 15-20 minutes Churn the mixture into a fine puree. Strain it back into the same pan make sure there is minimal wastage. Add butter, cream, chicken and kasoori meethi and let it simmer for 5-7 minutes. Garnish it with cream and kasoori methi. Butter Chicken is ready to be served!"
  },
  {
    "title": "Tandoori Paneer Tikka",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_23.jpg",
    "category": "veg",
    "ingredients": "Onion, Capsicum, Tomato, Paneer, Hung Curd, Coriender leaves, Turmeric Powder, Chilly Powder, Salt, Tandoori Tikka Masala, Kasuri Methi, Gharam Masala, Ginger garlic paste",
    "instructions": "For the marination take a bowl and add Hung curd to it, add chilly powder, a pinch of turmeric powder, gharam masala powder, a spoon of tandoori tikka masala, crushed kasuri methi, chopped Coriender leaves, ginger garlic paste and salt as per taste. Add diced veggies and paneer and mix it gently. Keep it aside for atleast 20-30min. Then insert the veggies and paneer to screwer and cook it directly in gas flame. Keep turning the screwer, apply butter on each side and your Tandoori paneer tikka is ready."
  },
  {
    "title": "Mushroom Cheese Masala",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_29.jpg",
    "category": "veg",
    "ingredients": "1 1/2 tbsp ghee, 1 large onion, 1 tbsp butter , 6 cloves of garlic , 1 tsp garam masala, 1 piece of ginger, 1 tsp red chilli powder , 2 green chillies, chopped, 1/4 tsp cumin powder , Coriander leaves, 1/2 cup cream, 1 tbsp cashew nuts, 15-16 button mushrooms , cheese grated, Salt to taste",
    "instructions": " Grind chopped onions, ginger, garlic, red chilli powder, roasted cumin seed powder, garam masala into a smooth paste. In a pan, heat ghee. Once the ghee is hot, add chopped green chilli and the onion paste. Add tomato pulp into the mixture. Cook it well. Add fresh cream, grated cheese and  mix well. Add water and allow it to boil. Add freshly chopped coriander leaves and add salt to taste. In a fresh pan, heat butter. Once the butter is melted, add chopped capsicums and sliced mushrooms. Allow it to cook for 2 to 3 minutes. Once cooked, add it into the mixture and mix well."
  },
  {
    "title": "Soya nuggets",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_24.jpg",
    "category": "veg",
    "ingredients": "1 cup Fortune Soya Chunks, 2 cups Warm Water, 1 cup Hung Curd , 1 tsp Red chilli powder, 1 tsp Coriander powder, ½ tsp Turmeric powder, 1 tsp Ginger garlic paste, 2 tbsp Besan , Salt to taste , Fortune Rice Bran Health Oil for frying , 1 tsp Chaat masala , Coriander leaves for garnish",
    "instructions": " 1. Soak soya nuggets in hot water for 10-15 minutes. Squeeze out all the water from the soya nuggets 2. In a mixing bowl combine soya nuggets, hung curd, besan. Ginger garlic paste, red chilli powder, coriander powder, turmeric powder, salt and mix well till soya nuggets is well coated 3. Deep fry the nuggets till golden brown colour 4. Sprinkle chaat masala and mix well. Serve garnish with chopped coriander leaves and dip of your choice."
  },
  {
    "title": "Egg Bread Masala",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_30.jpg",
    "category": "nonveg",
    "ingredients": " 2 Bread, 3 Eggs, ½ cup Onion fine chopped, ¼ cup Capsicum fine chopped, ¼ cup Cabbage, 1 Tomato fine chopped, ¼ tsp Turmeric Powder, ¼ tsp Red Chilli Powder, 1 tsp Coriander Powder, ¼ tsp Garam Masala Powder, 1 tbsp Coriander Leaves fine chopped, 3 Garlic Clove fine chopped, ½ tsp Ginger fine chopped, 1 tbsp Tomato Ketchup, Salt, 1 tbsp Oil",
    "instructions": "1.Cut bread in bite size pieces. Break eggs in a bowl and beat them nicely 2.Heat the oil in kadai or wok at medium heat. Once oil is hot add ginger and garlic and saute till they become slight brown. 3.Now add onions, mix well and cook till onion turns pink and soft 4.Once onions are pink add capsicum, carrots, cabbage and mix well. Cover the pan and cook till veggies are little soft 5.Once veggies are slightly soft add salt and mix well. Let the tomatoes cook till they become soft and mushy 6.When tomatoes are soft add turmeric powder, chilly, coriander and garam masala powder 7.Mix them well and add tomato ketchup and mix. Now take the veggies out in a bowl, and in the same pan add some oil 8.Pour the beaten egg over the oil, sprinkle some salt and cook till egg is semi cooked. Now add veggies in egg and mix it 9.Now add cut bread pieces and mix it well with veggies and eggs. Cook everything for some time and then sprinkle some oil over it 10.Garnish egg bread masala with fine chopped coriander leaves. Egg bread masala is ready to serve."
  },
  {
    "title": "Egg Gheeroast",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_10.jpg",
    "category": "nonveg",
    "ingredients": "Guntur dry red chilli 3-4 nos., Kashmiri dry red chilli 3-4 nos., Coriander seeds 1 tbsp, Jeera 1 tbsp, Black pepper corn 1 tbsp, Fennel seeds 1 tbsp, Methi seeds 1 tsp, Cloves 3-4 nos., Garlic 5-6 cloves, Ginger 1 inch, Tamarind water 2 tbsp, Water 2 tbsp, Ghee 2 tbsp, Boiled eggs cut into halves, Onion 1/4th cup (chopped), Curd 2 tbsp (whisked), Sugar / jaggery 1 tsp, Curry leaves 8-10 nos.",
    "instructions": "• Dry roast the whole red chillies for 2-3 minutes, dry roast the other whole spices until their aromas are released. Add the roasted whole spices along with roasted whole red chillies in a blending jar, add garlic, ginger and tamarind water, grind into a fine paste, adjust the consistency by adding little water. Heat ghee in a pan, shallow fry the eggs from both sides until golden brown. Heat the ghee in a wok, use the same ghee used for frying eggs, fry the chopped onions until they are translucent. Add the freshly prepared masala paste, stir and cook on low flame for 1-2 minutes, add curd and keep stirring continuously.  Increase the flame and cook until ghee is released. Add salt, sugar / jaggery to balance the taste, you can skip if u do not prefer sweet. Cook of another 2-3 minutes, add the fried eggs , curry leaves. Coat the eggs with the masala and cook further 3-4 minutes."
  },
  {
    "title": "Kadai Paneer",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_25.jpg",
    "category": "veg",
    "ingredients": " For kadai masala : 1 ½ tbsp Coriander seeds, 2 tsp Cumin seeds, 4-5 Kashmiri Red Chilli, 1 ½ tbsp Peppercorns, 1 tbsp salt. For Kadai Paneer : 1 tbsp Oil, 1 tsp Cumin seeds, 1 inch Ginger, chopped, 2 large Onion chopped, 1 tsp Ginger garlic paste, ½ tsp Turmeric Powder, 1 tsp Degi chilli powder, 1 tsp Coriander powder, 2 large Tomatoes puree 1 tsp Ghee, 1 tsp Oil, 1 Medium onion slice, ½ Capsicum slice, 1 Tomato slice, Salt to taste, 250 Gram paneer slice, 1 tsp Kashmiri chilli powder, 1 tbsp kadai masala, 1 tbsp Cream/ optional, Coriander Sprig",
    "instructions": "For Kadai masala : Take a pan. Add coriander seeds, cumin seeds, Kashmiri red chilli, peppercorn and salt. Dry roast it till you get a nutty aroma. Let it cool and grind it into fine powder. For Kadai Paneer : Take a pan, add oil/ghee. Now add cumin, ginger and saute well. Add onion, ginger garlic paste and saute till raw smell goes off. Add turmeric powder, degi chilli powder and coriander powder and saute well. Add tomato puree, salt to taste and water and let it cook. Take a pan, add oil/ ghee. Add slice onion, slice capcium, slice tomato and salt and saute for a minute. Add paneer slice to it and saute well. Add kashmiri chilli powder and prepared kadai masala to it and saute well. Add the prepared gravy to the pan and saute well. Add cream and mix well. Garnish it with coriander spring."
  },
  {
    "title": "Desi Egg Pastha",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_26.jpg",
    "category": "nonveg",
    "ingredients": "Pasta – ½ cup, Egg – 2, Onion – 1, Tomato – 1, Green capsicum – ¼ cup, Ginger garlic paste – ½ tsp, Red chilli powder – ½ tsp, Garam masala powder – ½ tsp, Salt – to taste, Cumin seeds – ¼ tsp, Oil – 1 tsp + 1 tsp",
    "instructions": "Boil water in a pot; add salt and a tsp oil to the rolling water. Now add pasta in it and cook till done. Now drain the water from pasta using colander and pour cold water over the cooked pasta so that it does not get sticky. Chop onion, tomato and green capsicum. Keep it aside. Heat oil in a pan add cumin seeds when it crackles add chopped onion and saute well. When the onions look sauteed add ginger garlic paste and saute well till the raw smell goes. When the raw smell of ginger garlic paste has gone add chopped tomatoes. Saute once then add red chilli powder, salt and garam masala powder. Mix and saute well till tomatoes becomes soft and cooked. When the tomatoes look mushy break 2 eggs and scramble it. While scrambling the eggs add the chopped capsicum and mix well. When the egg looks completely scrambled add the cooked pasta and toss well until everything is combined well."
  },
  {
    "title": "Baby Corn Chilli",
    "image": "https://aadishenoy.github.io/Food-JSON/gallery/img_27.jpg",
    "category": "veg",
    "ingredients": "For Batter: 2 tbsp refined flour, 1 tbsp corn starch, A pinch of Sal, ¼ cup wate, 1 tbsp corn starch (for Coating babycorn, 20 babycorn, cut into pieces, Oil to deep fry. For Sauce: 1 tbsp oil, 1 tbsp ginger, finely choppe, 1 tbsp garlic, finely choppe, 2 dry red chilli, roughly chopped, 1 medium onion, cut in quarters, 1 small capsicum, cut in cubes, 1 tbsp soy sauce, 2 fresh red & green chilli, slice, 1 tbsp green chilli sauc, 1 tbsp Sweet & Sour sauce, 1 tsp sugar, 1 tbsp corn flour slurry (corn flour + water mixed), Handful of spring onion",
    "instructions": " For Coating babycorn add refined flour, corn flour, salt and water to a bowl, mix well and set aside till in use. Add the corn starch to babycorn and coat well, pour over the prepared batter and mix well coating all the peices evenly. Deep fry the coated baby corn peices till light golden, drain on absorbent paper. Set aside till in use. Heat oil in a pan, add ginger, garlic, whole red chilli and celery. Mix well and sauté for a few minutes. Add onions and capsicum, sauté till onions are fragrant. Add soy sauce and toss well to coat. Add fresh red and green chillies, sauté for a few seconds. Add green chilli sauce, sweet & sour sauce, mix and toss well. Add little water, sugar and cook till it melts. Add some more water and the corn flour slurry, cook till the sauce thickens. Add the fried baby corn peices and spring onions, toss well. "
  }
]
